In [ ]:
Question 1 : Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

The fundamental differences between DDL (Data Definition Language), DML (Data Manipulation Language), and DQL (Data Query Language) in SQL lie in their purpose and the types of operations they perform on a database. Here is a summary along with examples for each type:

DDL (Data Definition Language)

DDL commands are used to define, modify, and manage the structure of database objects such as tables, views, schemas, and indexes. These commands directly impact the schema or design rather than the individual records, and changes are often auto-committed.‚Äã

Example:

CREATE TABLE Students (ID INT, Name VARCHAR(100)); creates a new table structure in the database.‚Äã

DML (Data Manipulation Language)

DML commands manipulate the actual data stored within tables. These commands allow users to insert, update, delete, or modify records, but do not change the structure of the tables themselves. Changes made by DML commands can be rolled back if not committed.‚Äã

Example:

INSERT INTO Students (ID, Name) VALUES (1, 'Alex'); adds a record to the existing "Students" table.‚Äã

DQL (Data Query Language)

DQL commands are focused solely on querying and retrieving data from tables. The primary DQL command is SELECT, which enables users to view data based on specified criteria, without modifying the data or structure itself.‚Äã

Example:

SELECT Name FROM Students WHERE ID = 1; fetches the name of the student with ID 1 from the "Students" table.‚Äã

The key distinctions are that DDL modifies the structure, DML changes the data, and DQL retrieves the data. Each command type serves a distinct role in database management, as illustrated in the provided examples

Question 2 : What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful.

The purpose of SQL constraints is to enforce rules on the data in a database table to ensure data accuracy, integrity, and consistency. Constraints prevent invalid data from being inserted, updated, or deleted.

Here are three common types of SQL constraints with explanations and examples:

In [ ]:
1. PRIMARY KEY Constraint

Purpose:
Ensures that each record in a table has a unique identifier and that the key
 column cannot contain NULL values.

Example Scenario:
In a Students table, each student must have a unique ID.

CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT
);


 Ensures no two students have the same StudentID and that every student has one.

2. FOREIGN KEY Constraint

Purpose:
Maintains referential integrity between two tables. It ensures that a value in
 one table (child) must match a value in another table (parent).

Example Scenario:
In an Orders table, each order must be linked to a valid customer in the Customers table.

CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);


 Prevents an order from being assigned to a non-existent customer.

3. CHECK Constraint

Purpose:
Ensures that all values in a column satisfy a specific condition.

Example Scenario:
In an Employees table, salary values must be greater than 0.

CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    Name VARCHAR(50),
    Salary DECIMAL(10,2) CHECK (Salary > 0)
);

Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?

In [ ]:
In SQL, the LIMIT and OFFSET clauses are used to control the number of row
 returned by a query ‚Äî especially useful for pagination (showing results page by page).

1. LIMIT Clause

Purpose: Specifies the maximum number of records to return.

Example:

SELECT * FROM Employees LIMIT 10;

 Returns only the first 10 rows from the result set.

2. OFFSET Clause

Purpose: Specifies how many rows to skip before starting to return rows.

Example:

SELECT * FROM Employees OFFSET 20;

 Skips the first 20 rows, then returns all remaining rows.

Using LIMIT and OFFSET Together (for Pagination)

When displaying results across multiple pages, you can combine LIMIT and OFFSET to fetch specific pages.

Example Scenario:

Each page shows 10 records.

You want to retrieve the third page.

Calculation:

For the third page, skip the first 20 records (10 records per page √ó 2 pages before it).

SQL Query:

SELECT *
FROM Employees
LIMIT 10 OFFSET 20;

This query:
Skips the first 20 records.
Returns the next 10 records (i.e., records 21‚Äì30).

Question 4 : What is a Common Table Expression (CTE) in SQL, and what are its main benefits? Provide a simple SQL example demonstrating its usage.

Answer:

A Common Table Expression (CTE) in SQL is a temporary, named result set that you can reference within a SELECT, INSERT, UPDATE, or DELETE statement.
It is defined using the WITH keyword and exists only for the duration of the query.

In [ ]:
WITH cte_name AS (
    -- SQL query that defines the CTE
    SELECT ...
)
SELECT ...
FROM cte_name;

üîπ Main Benefits of Using a CTE

Improves Readability and Organization

Makes complex queries easier to understand by breaking them into logical parts.

Allows Reuse of Results

You can refer to the same CTE multiple times in a query without rewriting subqueries.

Supports Recursive Queries

Useful for working with hierarchical or tree-structured data (e.g., employee‚Äìmanager relationships).

Example: Using a CTE

Scenario:
You want to find employees who earn above the average salary.

SQL Query:

In [ ]:
WITH AvgSalary AS (
    SELECT AVG(Salary) AS AverageSalary
    FROM Employees
)
SELECT Name, Salary
FROM Employees, AvgSalary
WHERE Employees.Salary > AvgSalary.AverageSalary;

Explanation:

The CTE AvgSalary calculates the average salary once.

The main query then selects all employees whose salary is greater than the average.

Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).

SQL Normalization is the process of organizing data in a database to reduce redundancy (duplicate data) and improve data integrity (consistency and accuracy).
It involves dividing large, complex tables into smaller, related ones and defining relationships between them.

üîπ Primary Goals of Normalization

Eliminate redundant data (avoid storing the same data in multiple places).

Ensure data dependencies make sense (each data item is stored logically).

Simplify maintenance and updates (reduce anomalies when inserting, updating, or deleting data).

Improve data integrity and database efficiency.

üî∏ The First Three Normal Forms
1Ô∏è‚É£ First Normal Form (1NF)

Rule:

Each column must contain atomic (indivisible) values.

Each row must be unique (use a primary key).

No repeating groups or arrays are allowed.

Example (Before 1NF):

StudentID    	Name	          Subjects
1             Alex	      Math, Science


After 1NF:

StudentID	                Name               	Subject
1	                        Alex                  	Math
1                       	Alex	                 Science

‚úÖ Each column has atomic values.

2Ô∏è‚É£ Second Normal Form (2NF)

Rule:

Must be in 1NF.

No partial dependency ‚Äî every non-key column must depend on the entire primary key, not part of it.
(Applies only to tables with composite primary keys.)

Example (Before 2NF):

StudentID   	CourseID	 StudentName      	CourseName
1	              101	        Alex            	Math


After 2NF: Split into two tables:

Students: (StudentID, StudentName)

Courses: (CourseID, CourseName)

Enrollments: (StudentID, CourseID)

‚úÖ Removes partial dependency.

3Ô∏è‚É£ Third Normal Form (3NF)

Rule:

Must be in 2NF.

No transitive dependency ‚Äî non-key columns must depend only on the primary key, not on other non-key columns.

Example (Before 3NF):

EmployeeID	      Name	           DeptID	        DeptName
1	                 John            	D01	            HR

After 3NF:

Employees: (EmployeeID, Name, DeptID)

Departments: (DeptID, DeptName)

 Removes transitive dependency.

Question 6 : Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
‚óè Categories
‚óã CategoryID (INT, PRIMARY KEY)
‚óã CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
‚óè Products
‚óã ProductID (INT, PRIMARY KEY)
‚óã ProductName (VARCHAR(100), NOT NULL, UNIQUE)
‚óã CategoryID (INT, FOREIGN KEY ‚Üí Categories)
‚óã Price (DECIMAL(10,2), NOT NULL)
‚óã StockQuantity (INT)
‚óè Customers
‚óã CustomerID (INT, PRIMARY KEY)
‚óã CustomerName (VARCHAR(100), NOT NULL)
‚óã Email (VARCHAR(100), UNIQUE)
‚óã JoinDate (DATE)
‚óè Orders
‚óã OrderID (INT, PRIMARY KEY)
‚óã CustomerID (INT, FOREIGN KEY ‚Üí Customers)
‚óã OrderDate (DATE, NOT NULL)
‚óã TotalAmount (DECIMAL(10,2))

In [ ]:
-- 1. Create the Database
CREATE DATABASE ECommerceDB;

-- 2. Use the Database
USE ECommerceDB;

-- 3. Create the Categories Table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- 4. Create the Products Table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- 5. Create the Customers Table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- 6. Create the Orders Table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

Insert the following records into each table
‚óè Categories
CategoryID        Category Name
1               Electronics
2              Books
3             Home Goods
4               Apparel

In [ ]:
-- Use the ECommerceDB database
USE ECommerceDB;

-- Insert records into the Categories table
INSERT INTO Categories (CategoryID, CategoryName)
VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

Products
ProductID      ProductName     CategoryID      Price      StockQuantity

101            Laptop Pro             1          1200.00        50

102              SQLHandbook          2          45.50          200


103             Smart Speaker          1          99.99          150


104            Coffee Maker            3           75.00           80

105            Novel : The Great SQL   2           25.00           120

106            Wireless Earbuds         1         150.00         100
107            Blender X                3          120.00           60
108             T-Shirt Casual         4           20.00           300

In [ ]:
-- Use the ECommerceDB database
USE ECommerceDB;

-- Insert records into the Products table
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity)
VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

Customers
CustomerID   CustomerName           Email                    Joining Date
1          Alice Wonderland       alice@example.com          2023-01-10
2           Bob the Builder      bob@example.com            2022-11-25

3          Charlie Chaplin       charlie@example.com         2023-03-01

4          Diana Prince          diana@example.com           2021-04-26

In [ ]:
-- Use the ECommerceDB database
USE ECommerceDB;

-- Insert records into the Customers table
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate)
VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

Orders
OrderID   CustomerID    OrderDate       TotalAmount
1001          1           2023-04-26    1245.50
1002         2            2023-10-12      99.99
1003         1           2023-07-01      145.00
1004        3            2023-01-14      150.00
1005        2           2023-09-24       120.00
1006         1           2023-06-19           20.00

In [ ]:
-- Use the ECommerceDB database
USE ECommerceDB;

-- Insert records into the Orders table
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount)
VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

Question 7 : Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results by CustomerName.

In [ ]:
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM
    Customers c
LEFT JOIN
    Orders o
ON
    c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerName, c.Email
ORDER BY
    c.CustomerName;

Question 8 : Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically.

In [ ]:
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products p
INNER JOIN
    Categories c
ON
    p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;

Question 9 : Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

In [ ]:
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (
            PARTITION BY c.CategoryName
            ORDER BY p.Price DESC
        ) AS PriceRank
    FROM
        Products p
    INNER JOIN
        Categories c
    ON
        p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    PriceRank <= 2
ORDER BY
    CategoryName,
    Price DESC;

Question 10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they‚Äôve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months.

Top 5 Customers by Total Amount Spent

In [ ]:
SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    SUM(p.amount) AS TotalSpent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, CustomerName, c.email
ORDER BY
    TotalSpent DESC
LIMIT 5;

2Ô∏è‚É£ Top 3 Movie Categories by Rental Counts

In [ ]:
SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM
    category cat
JOIN
    film_category fc ON cat.category_id = fc.category_id
JOIN
    film f ON fc.film_id = f.film_id
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    cat.name
ORDER BY
    RentalCount DESC
LIMIT 3;

3Ô∏è‚É£ Films Available per Store and Never Rented Count

In [ ]:
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS TotalFilms,
    COUNT(i.inventory_id) - COUNT(DISTINCT r.inventory_id) AS NeverRented
FROM
    store s
JOIN
    inventory i ON s.store_id = i.store_id
LEFT JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id;

4Ô∏è‚É£ Total Revenue per Month for the Year 2023

In [ ]:
SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS Month,
    SUM(p.amount) AS TotalRevenue
FROM
    payment p
WHERE
    YEAR(p.payment_date) = 2023
GROUP BY
    Month
ORDER BY
    Month;

5Ô∏è‚É£ Customers with More Than 10 Rentals in the Last 6 Months

In [ ]:
SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS CustomerName,
    c.email,
    COUNT(r.rental_id) AS RentalCount
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY
    c.customer_id, CustomerName, c.email
HAVING
    COUNT(r.rental_id) > 10
ORDER BY
    RentalCount DESC;